Tekla Open API Reference for Tekla Structures 2025
ComponentItemEnumerator Methods
The ComponentItemEnumerator type exposes the following members.
Methods
Name | Description
GetSize
 Returns the total amout of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
See Also
Reference
ComponentItemEnumerator Class
Tekla.Structures.Catalogs Namespace